Revit 2027 API
Category.IsVisibleInUI Property
 Identifies if the category is visible to the user and should be displayed in UI.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsVisibleInUI { get; }
Public ReadOnly Property IsVisibleInUI As Boolean
	Get
public:
property bool IsVisibleInUI {
	bool get ();
}
member IsVisibleInUI : bool with get
Property Value
Boolean
 True if the category should be displayed in UI.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace